import time
from GraduateClass import Graduate,get_data_frame
from copypasteexcel import copy_paste_excel_columns
from excel2dict import excel2dict
n = range(1,5)
if __name__ == '__main__':
    ##################################
    ##################################
    # categories = ['0831']
    categories = ['0101', '0201', '0202', '0251', '0252', '0253', '0254', '0255', '0256', 
                  '0257', '0270', '0301', '0302', '0303', '0304', '0305', '0306', '0351', 
                  '0352', '0353', '0401', '0402', '0403', '0451', '0452', '0453', '0454', 
                  '0471', '0501', '0502', '0503', '0551', '0552', '0553', '0601', '0602', 
                  '0603', '0651', '0701', '0702', '0703', '0704', '0705', '0706', '0707', 
                  '0708', '0709', '0710', '0711', '0712', '0713', '0714', '0771', '0772', 
                  '0773', '0774', '0775', '0776', '0777', '0778', '0779', '0780', '0781', 
                  '0782', '0783', '0784', '0785', '0786', '0801', '0802', '0803', '0804', 
                  '0805', '0806', '0807', '0808', '0809', '0810', '0811', '0812', '0813', 
                  '0814', '0815', '0816', '0817', '0818', '0819', '0820', '0821', '0822', 
                  '0823', '0824', '0825', '0826', '0827', '0828', '0829', '0830', '0831', 
                  '0832', '0833', '0834', '0835', '0836', '0837', '0838', '0839', '0851', 
                  '0853','0854', '0855', '0856', '0857', '0858', '0859', '0860', '0861', 
                  '0870', '0871', '0872', '0901', '0902', '0903', '0904', '0905', '0906',
                  '0907', '0908', '0909', '0951', '0952', '0953', '0954', '0970', '0971', 
                  '0972', '0973', '1001', '1002', '1003', '1004', '1005', '1006', '1007', 
                  '1008', '1009', '1010', '1011', '1051', '1052', '1053', '1054', '1055',
                  '1056', '1057', '1071', '1072', '1073', '1074', '1101', '1102', '1103', 
                  '1104', '1105', '1106', '1107', '1108', '1109', '1110', '1151', '1201',
                  '1202', '1203', '1204', '1205', '1251', '1252', '1253', '1254', '1255', 
                  '1256', '1301', '1302', '1303', '1304', '1305', '1351', '1401', '1402']
    savepath = r'C:\Users\lenovo\Desktop\BCI APPLICATION\webProj\item\yzw_spider\all_city_data\\'
    # savepath = r'C:\Users\lenovo\Desktop\勤思2023\spider_fromcuiqingcai\yzw_spider\所有数据'
    provinceNmaeDict = {
    '11': '北京市',
    '37': '山东省',
    '22': '吉林省',
    '12': '天津市',
    '13': '河北省',
    '14': '山西省',
    '15': '内蒙古自治区',
    '21': '辽宁省',
    '23': '黑龙江省',
    '31': '上海市',
    '32': '江苏省',
    '33': '浙江省',
    '34': '安徽省',
    '35': '福建省',
    '36': '江西省',
    '41': '河南省',
    '42': '湖北省',
    '43': '湖南省',
    '44': '广东省',
    '45': '广西壮族自治区',
    '46': '海南省',
    '50': '重庆市',
    '51': '四川省',
    '52': '贵州省',
    '53': '云南省',
    '54': '西藏自治区',
    '61': '陕西省',
    '62': '甘肃省',
    '63': '青海省',
    '64': '宁夏回族自治区',
    '65': '新疆维吾尔自治区',
    '71': '台湾省',
    '81': '香港特别行政区',
    '82': '澳门特别行政区'
    }
    ##################################
    ##################################
    for i in list(provinceNmaeDict.keys()): #将keys转化为列表
        last_data = []
        province = i
        for category in categories:
            if province in provinceNmaeDict.keys():
                spyder = Graduate(province, category, provinceNmaeDict[province])
                spyder.get_schools_data()
                last_data.extend(spyder.data)
                print(last_data)
        openfilename = get_data_frame(last_data,provinceNmaeDict[province]) #写入表格 
        # time.sleep(1) # 延迟时间1s            
        for j in n:
            copy_paste_excel_columns(openfilename,j,savepath,provinceNmaeDict[province]) #清理数据

